Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.CreateProfileString Method
 Gets the parametric profile item prefix and adds parameter values.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CreateProfileString()
Public Function CreateProfileString As String
Return Value
Type: String
The parametric profile string with parameter values in millimeters.
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace